{"name":"uci_reuters-21578-text-categorization-collection","title":"Reuters-21578 Text Categorization Collection","description":"This is a collection of documents that appeared on Reuters newswire in 1987. The documents were assembled and indexed with categories.\n\n# Source:\nDavid D. LewisAT&T Labs - Research  lewis '@' research.att.com\nDocuments came from Reuters newswire in 1987.\n# Data Set Information:\nFrom the original readme file (please consult it for more information):************-The documents in the Reuters-21578 collection appeared on the Reuters newswire in 1987. The documents were assembled and indexed with categories by personnel from Reuters Ltd. (Sam Dobbins, Mike Topliss, Steve Weinstein) and Carnegie Group, Inc. (Peggy Andersen, Monica Cellio, Phil Hayes, Laura Knecht, Irene Nirenburg) in 1987. \nIn 1990, the documents were made available by Reuters and CGI for research purposes to the Information Retrieval Laboratory (W. Bruce Croft, Director) of the Computer and Information Science Department at the University of Massachusetts at Amherst. Formatting of the documents and production of associated data files was done in 1990 by David D. Lewis and Stephen Harding at the Information Retrieval Laboratory.\nFurther formatting and data file production was done in 1991 and 1992 by David D. Lewis and Peter Shoemaker at the Center for Information and Language Studies, University of Chicago. This version of the data was made available for anonymous FTP as \"Reuters-22173, Distribution 1.0\" in January 1993. From 1993 through 1996, Distribution 1.0 was hosted at a succession of FTP sites maintained by the Center for Intelligent Information Retrieval (W. Bruce Croft, Director) of the Computer Science Department at the University of Massachusetts at Amherst.\nAt the ACM SIGIR '96 conference in August, 1996 a group of text categorization researchers discussed how published results on Reuters-22173 could be made more comparable across studies. It was decided that a new version of collection should be produced with less ambiguous formatting, and including documentation carefully spelling out standard methods of using the collection. The opportunity would also be used to correct a variety of typographical and other errors in the categorization and formatting of the collection.\nSteve Finch and David D. Lewis did this cleanup of the collection September through November of 1996, relying heavily on Finch's SGML-tagged version of the collection from an earlier study. One result of the re-examination of the collection was the removal of 595 documents which were exact duplicates (based on identity of timestamps down to the second) of other documents in the collection. The new collection therefore has only 21,578 documents, and thus is called the Reuters-21578 collection. This README describes version 1.0 of this new collection, which we refer to as \"Reuters-21578, Distribution 1.0\".\nIn preparing the collection and documentation we have benefited from discussions with Eric Brown, William Cohen, Fred Damerau, Yoram Singer, Amit Singhal, and Yiming Yang, among many others.\nWe thank all the people and organizations listed above for their efforts and support, without which this collection would not exist.\n# Attribute Information:\nReuters-21578, Distribution 1.0 includes five files (all-exchanges-strings.lc.txt, all-orgs-strings.lc.txt, all-people-strings.lc.txt, all-places-strings.lc.txt, and all-topics-strings.lc.txt) which list the names of *all* legal categories in each set. A sixth file, cat-descriptions_120396.txt gives some additional information on the category sets.\n# Relevant Papers:\nChidanand Apt, Fred Damerau, Sholom M. Weiss. \"Automated Learning of Decision Rules for Text Categorization.\" ACM Transactions on Information Systems, 1994. \nChidanand Apt, Fred Damerau, Sholom M. Weiss, \"Toward Language Independent Automated Learning of Text Categorization Models.\" SIGIR 1994. \nPhilip J. Hayes, Peggy M. Anderson, rene B. Nirenburg, Linda M. Schmandt. \"TCS: A Shell for Content-Based Text Categorization.\" IEEE Conference on Artificial Intelligence Applications, 1990. \nPhilip J. Hayes and Steven P. Weinstein. \"CONSTRUE/TIS: A System for Content-Based Indexing of a Database of News Stories.\" Second Annual Conference on Innovative Applications of Artificial Intelligence, 1990. \n# Papers That Cite This Data Set1:\nManuel Oliveira. Library Release Form Name of Author: Stanley Robson de Medeiros Oliveira Title of Thesis: Data Transformation For Privacy-Preserving Data Mining Degree: Doctor of Philosophy Year this Degree Granted. University of Alberta Library. 2005.\n * David Littau and Daniel Boley. Using Low-Memory Representations to Cluster Very Large Data Sets. SDM. 2003.\n * Bianca Zadrozny and Charles Elkan. Transforming classifier scores into accurate multiclass probability estimates. KDD. 2002.\n * Vijay S. Iyengar and Chidanand Apt and Tong Zhang. Active learning using adaptive resampling. KDD. 2000.\n * Dmitry Pavlov and Jianchang Mao and Byron Dom. Scaling-Up Support Vector Machines Using Boosting Algorithm. ICPR. 2000.\n * Daphne Koller and Mehran Sahami. Toward Optimal Feature Selection. ICML. 1996.\n * Omid Madani and David M. Pennock and Gary William Flake. Co-Validation: Using Model Disagreement to Validate Classification Algorithms. Yahoo! Research Labs.\n * Thomas T. Osugi and M. S. EXPLORATION-BASED ACTIVE MACHINE LEARNING. Faculty of The Graduate College at the University of Nebraska In Partial Fulfillment of Requirements.\n * Vikas Sindhwani and P. Bhattacharya and Subrata Rakshit. Information Theoretic Feature Crediting in Multiclass Support Vector Machines.\n\n# Citation Request:\nThe copyright for the text of newswire articles and Reuters annotations in the Reuters-21578 collection resides with Reuters Ltd. Reuters Ltd. and Carnegie Group, Inc. have agreed to allow the free distribution of this data *for research purposes only*. \nIf you publish results based on this data set, please acknowledge its use, refer to the data set by the name \"Reuters-21578, Distribution 1.0\", and inform your readers of the current location of the data set (see \"Availability & Questions\").[1] Papers were automatically harvested and associated with this data set, in collaborationwith [Rexa.info](http://rexa.info/)\n\n**_Source:_** http://archive.ics.uci.edu/ml/datasets/Reuters-21578+Text+Categorization+Collection","homepage":"https://data.world/uci/reuters-21578-text-categorization-collection","license":"Other","resources":[{"name":"original/README.txt","path":"original/README.txt","format":"txt","mediatype":"text/plain","bytes":36388},{"name":"original/all-exchanges-strings.lc.txt","path":"original/all-exchanges-strings.lc.txt","format":"txt","mediatype":"text/plain","bytes":186},{"name":"original/all-orgs-strings.lc.txt","path":"original/all-orgs-strings.lc.txt","format":"txt","mediatype":"text/plain","bytes":316},{"name":"original/all-people-strings.lc.txt","path":"original/all-people-strings.lc.txt","format":"txt","mediatype":"text/plain","bytes":2474},{"name":"original/all-places-strings.lc.txt","path":"original/all-places-strings.lc.txt","format":"txt","mediatype":"text/plain","bytes":1721},{"name":"original/all-topics-strings.lc.txt","path":"original/all-topics-strings.lc.txt","format":"txt","mediatype":"text/plain","bytes":1005},{"name":"original/cat-descriptions_120396.txt","path":"original/cat-descriptions_120396.txt","format":"txt","mediatype":"text/plain","bytes":28194},{"name":"original/feldman-cia-worldfactbook-data.txt","path":"original/feldman-cia-worldfactbook-data.txt","format":"txt","mediatype":"text/plain","bytes":273802},{"name":"original/lewis.dtd","path":"original/lewis.dtd","format":"dtd","mediatype":"application/xml-dtd","bytes":1485},{"name":"original/reut2-000.sgm","path":"original/reut2-000.sgm","format":"sgm","mediatype":"text/sgml","bytes":1324350},{"name":"original/reut2-001.sgm","path":"original/reut2-001.sgm","format":"sgm","mediatype":"text/sgml","bytes":1254440},{"name":"original/reut2-002.sgm","path":"original/reut2-002.sgm","format":"sgm","mediatype":"text/sgml","bytes":1217495},{"name":"original/reut2-003.sgm","path":"original/reut2-003.sgm","format":"sgm","mediatype":"text/sgml","bytes":1298721},{"name":"original/reut2-004.sgm","path":"original/reut2-004.sgm","format":"sgm","mediatype":"text/sgml","bytes":1321623},{"name":"original/reut2-005.sgm","path":"original/reut2-005.sgm","format":"sgm","mediatype":"text/sgml","bytes":1388644},{"name":"original/reut2-006.sgm","path":"original/reut2-006.sgm","format":"sgm","mediatype":"text/sgml","bytes":1254765},{"name":"original/reut2-007.sgm","path":"original/reut2-007.sgm","format":"sgm","mediatype":"text/sgml","bytes":1256772},{"name":"original/reut2-008.sgm","path":"original/reut2-008.sgm","format":"sgm","mediatype":"text/sgml","bytes":1410117},{"name":"original/reut2-009.sgm","path":"original/reut2-009.sgm","format":"sgm","mediatype":"text/sgml","bytes":1338903},{"name":"original/reut2-010.sgm","path":"original/reut2-010.sgm","format":"sgm","mediatype":"text/sgml","bytes":1371071},{"name":"original/reut2-011.sgm","path":"original/reut2-011.sgm","format":"sgm","mediatype":"text/sgml","bytes":1304117},{"name":"original/reut2-012.sgm","path":"original/reut2-012.sgm","format":"sgm","mediatype":"text/sgml","bytes":1323584},{"name":"original/reut2-013.sgm","path":"original/reut2-013.sgm","format":"sgm","mediatype":"text/sgml","bytes":1129687},{"name":"original/reut2-014.sgm","path":"original/reut2-014.sgm","format":"sgm","mediatype":"text/sgml","bytes":1128671},{"name":"original/reut2-015.sgm","path":"original/reut2-015.sgm","format":"sgm","mediatype":"text/sgml","bytes":1258665},{"name":"original/reut2-016.sgm","path":"original/reut2-016.sgm","format":"sgm","mediatype":"text/sgml","bytes":1316417},{"name":"original/reut2-017.sgm","path":"original/reut2-017.sgm","format":"sgm","mediatype":"text/sgml","bytes":1546911},{"name":"original/reut2-018.sgm","path":"original/reut2-018.sgm","format":"sgm","mediatype":"text/sgml","bytes":1258819},{"name":"original/reut2-019.sgm","path":"original/reut2-019.sgm","format":"sgm","mediatype":"text/sgml","bytes":1261780},{"name":"original/reut2-020.sgm","path":"original/reut2-020.sgm","format":"sgm","mediatype":"text/sgml","bytes":1049566},{"name":"original/reut2-021.sgm","path":"original/reut2-021.sgm","format":"sgm","mediatype":"text/sgml","bytes":621648},{"name":"original/reuters21578.html","path":"original/reuters21578.html","format":"html","mediatype":"text/html","bytes":831}],"keywords":["uci","categorical","classification"]}